# Config file for Antibody, a zsh plugin manager
# see: https://getantidote.github.io


# plugins to check out:
# ohmyzsh/ohmyzsh path:plugins/colored-man-pages
# ohmyzsh/ohmyzsh path:plugins/magic-enter
# ohmyzsh/ohmyzsh path:plugins/extract adds an `extract` command that unarchives many archive formats
# romkatv/zsh-bench # benchmarking for checking zsh startup times


#
# Oh-My-Zsh compatibility
#

# If you use Oh-My-Zsh with antidote, load this plugin FIRST to set things up so you don't have to worry about whether
# Oh-My-Zsh will work correctly.
# getantidote/use-omz

# if using any of ohmyzsh/* plugins, add omx's core lib
# ohmyzsh/ohmyzsh path:lib


#
# completions
#

# automagically handles the zsh completion system (no more need to call `compinit`)
# alt: belak/zsh-utils path:completions
mattmc3/ez-compinit

# massive collection of additional completion definitions for Zsh
zsh-users/zsh-completions kind:fpath path:src

# replace zsh's default completion selection menu with fzf
# toggle on/off with enable-/disable-fzf-tab
aloxaf/fzf-tab

# Add additional completion styles, and enable one by default
# post:... selects which to enable by default
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup


#
# prompts
#

# enable the zsh prompt system (no more need to call `promptinit` and `prompt pure`)
belak/zsh-utils path:prompt

# add the spaceship prompt
romkatv/powerlevel10k


#
# fish-like utilities
#

# in-terminal syntax highlighting
zdharma-continuum/fast-syntax-highlighting kind:defer

# adds fish-like auto-suggestions when typing
zsh-users/zsh-autosuggestions

# adds fish-like up/down history searching
# zsh-users/zsh-history-substring-search
# todo: investigate


#
# everything else
#

# override and fill in the gaps of the default zsh keybinds
belak/zsh-utils path:editor

# load and initilize the built-in zsh history system, with some QoL tweaks
# belak/zsh-utils path:history
# todo: investigate

# replaces zsh's built-in ctrl-r history search with a fzf-powered one
# joshskidmore/zsh-fzf-history-search
# todo: investigate

# common shell utilities, aimed at making cross platform work less painful
# adds `o`, `pbcopy`, and `pbpaste`, among others
belak/zsh-utils path:utility

# add the `z` utility
rupa/z

# add the `evalcache` utility to cache the output of a binary initialization command
# `evalcache` is used to help lower shell startup time (see ./.config/zsh/setup-eval-caching.zsh)
mroth/evalcache
