{
  "lazy.nvim": { "branch": "main" },
  "neovim": { "branch": "main" },
  "nerdtree": { "branch": "master" },
  "solarized-osaka.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-airline": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-devicons": { "branch": "master" },
  "vim-magnum": { "branch": "master" },
  "vim-radical": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-speeddating": { "branch": "master" },
  "vim-surround": { "branch": "master" }
}