# Config file for Antibody, a zsh plugin manager
# see: https://getantidote.github.io

# plugins to check out:
# olets/zsh-abbr    kind:defer
# mattmc3/zfunctions
# zsh-users/zsh-autosuggestions
# zdharma-continuum/fast-syntax-highlighting kind:defer
# zsh-users/zsh-syntax-highlighting
# zsh-users/zsh-history-substring-search

#
# completions
#

# load the zsh completion system (no need for compinit!)
mattmc3/ez-compinit
# alt: belak/zsh-utils path:completions

# add completions
zsh-users/zsh-completions kind:fpath path:src


#
# prompts
#

# enable the zsh prompt system (no need for promptinit and prompt pure!)
belak/zsh-utils path:prompt

# add prompts
spaceship-prompt/spaceship-prompt


#
# oh-my-zsh
#

# how to use oh-my-zsh:
# getantidote/use-omz        # handle OMZ dependencies
# ohmyzsh/ohmyzsh path:lib   # load OMZ's library
# 
# load OMZ plugins:
# ohmyzsh/ohmyzsh path:plugins/colored-man-pages
# ohmyzsh/ohmyzsh path:plugins/magic-enter


#
# all other plugins
#

belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:utility
rupa/z
# export NVM_LAZY_LOAD=true
# export NVM_COMPLETION=true
# NVM_ configs must be set in .zshrc before antidote is called
lukechilds/zsh-nvm

mroth/evalcache

